# 1. Load The Data

In [1]:
import pandas as pd
import numpy as np

In [2]:
# 将文件导入到python中
employee = pd.read_csv("Employee.csv")
employee

   id  salary
0   1     100
1   2     200
2   3     400
3   4     400

# 2. Data Processing

## Rank的用法：
https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.rank.html

DataFrame.rank(axis=0, method='average', numeric_only=None, na_option='keep', ascending=True, pct=False)
- method: 取值可以为'average'，'first'，'min'， 'max'，'dense'
    - "first": 顾名思义，第一个，谁出现的位置靠前，谁的排名靠前。比如说这一题，如果我们的method = ‘first’，那么对应的排序是1:4, 2:3, 3:1, 4:2，因为id = 3是出现在id = 4之前的，所以尽管id = 3和4的salary是一样，但是id = 3的rank是比id = 4的rank要高的。当method取值为min，max，average时，都是要参考“顺序排名”的。
    - "dense": 其实就是sql里面的dense rank的意思，也就是说相同成绩的同学排名相同，其他的就是正常排名。
    - average: 成绩相同时，取顺序排名中所有名次之和除以该成绩的个数，即为该成绩的名次。比如说id = 3和4，如果没有并列，其实他们必定有一个是rank = 1另一个rank = 2，那么当我们method = average的时候，二者是同样的rank，也就是(1+2)/2 = 1.5
- na_option： NaN值是否参与排序及如何排序（‘keep’，‘top'，’bottom'）

## 根据列的值选取多行数据：
- 选取等于某些值的行记录
    - employee.loc[employee['rank'] == 2]
- 选取不等于某些值的行记录，用!=,比如说我们想要选取rank != 2的
    - employee.loc[employee['rank'] != 2]
- 选取某列是否是某一类型的数值：比如说我们想要选取id为1以及2
    - employee.loc[employee['id'].isin(['1','2'])]
- isin返回一系列的数值，但是如果我们要选择不符合这个条件的数值可以使用~ , 比如说我们想要抽取除了id = 1以及2的别的所有值
    - employee.loc[~employee['id'].isin(['1','2'])]
- 多种条件的选取用&：比如我们想要选择rnk = 1并且id = 3的
    - employee.loc[(employee['id']==3) & (employee['rank'] == 1)]

In [3]:
employee['rank'] = employee['salary'].rank(method='dense',ascending=False)
employee

   id  salary  rank
0   1     100   3.0
1   2     200   2.0
2   3     400   1.0
3   4     400   1.0

In [4]:
employee.loc[employee['rank'] == 2]

   id  salary  rank
1   2     200   2.0

# Output

In [16]:
# Input: 
# Employee table:
# +----+--------+
# | id | salary |
# +----+--------+
# | 1  | 100    |
# | 2  | 200    |
# | 3  | 300    |
# +----+--------+
# Output: 
# +---------------------+
# | SecondHighestSalary |
# +---------------------+
# | 200                 |
# +---------------------+